<template>
	<view style="background-color: aqua; height: 150vh;" class="combox">
		和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是
		和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是
		和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是
		和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是
		和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是
		和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是和飞机撒风格和角色和风格设计风格和但是
	</view>
</template>

<script setup>
	
</script>

<style lang="scss" scoped>
	// 搜索框
	.combox{
		padding-bottom: calc( env(safe-area-inset-bottom) + 3px);  //使用自带的安全距离
	}
</style>